Show / Hide Table of Contents
Class NonConformity
Non-conformity
Inheritance
System.Object
NonConformity
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
public class NonConformity
Constructors
Improve this Doc   View Source
NonConformity()
Constructor
Declaration
public NonConformity()
Properties
Improve this Doc   View Source
Guid
Description of the nonconformity
Declaration
public Guid Guid { get; set; }
Property Value
 Type |  Description
 System.Guid
Improve this Doc   View Source
Severity
severity of this nonconformity
Declaration
public NonConformitySeverity Severity { get; set; }
Property Value
 Type |  Description
 NonConformitySeverity
 Improve this Doc
 View Source